{
  "name": "HR-BR",
  "version": "1.3",
  "date": "2025-07-03",
  "data": [
    {
      "Pravilo": "HR-BR-1",
      "Opis": "Broj računa ne smije sadržavati bjeline (whitespace znakove)"
    },
    {
      "Pravilo": "HR-BR-2",
      "Opis": "Račun mora imati vrijeme izdavanja računa (HR-BT-2)."
    },
    {
      "Pravilo": "HR-BR-4",
      "Opis": "U slučaju pozitivnog iznosa koji dospijeva na plaćanje (BT-115), datum dospijeća plaćanja (BT-9) mora biti naveden."
    },
    {
      "Pravilo": "HR-BR-5",
      "Opis": "Identifikator specifikacije mora imati vrijednost 'urn:cen.eu:en16931:2017#compliant#urn:mfin.gov.hr:cius-2025:1.0#conformant#urn: mfin.gov.hr:ext-2025:1.0'"
    },
    {
      "Pravilo": "HR-BR-6",
      "Opis": "Svaka referenca prethodnog računa (BG-3) mora imati datum izdavanja prethodnog računa (BT-26)"
    },
    {
      "Pravilo": "HR-BR-7",
      "Opis": "Elektronička adresa Prodavatelja (BT-34) mora biti navedena"
    },
    {
      "Pravilo": "HR-BR-9",
      "Opis": "Račun mora sadržavati OIB operatera"
    },
    {
      "Pravilo": "HR-BR-10",
      "Opis": "Elektronička adresa Kupca (BT-37) mora biti navedena."
    },
    {
      "Pravilo": "HR-BR-11",
      "Opis": "Svaki troškak na razini dokumenta (BG-21) koji ne podliježe PDV-u ili je oslobođen PDV-a mora imati oznaku kategorije PDV-a troška na razini dokumenta (HR-BT-6) iz tablice HR-TB-2 HR oznaka kategorija PDV-a"
    },
    {
      "Pravilo": "HR-BR-13",
      "Opis": "Svaki troškak na razini dokumenta (BG-21) koji ne podliježe PDV-u ili je oslobođen mora imati razlog oslobođenja PDV-a troška na razini dokumenta (HR-BT-6) ili kod razloga oslobođenja PDV-a a troška na razini dokumenta (HR-BT-7)"
    },
    {
      "Pravilo": "HR-BR-16",
      "Opis": "Svaka stavka računa (BG-25) koja ne podliježe PDV-u ili je oslobođena od PDV-a mora imati oznaku kategorije PDV-a obračunate stavke HR-BT-12 iz šifarnika oznaka kategorija PDV-a HR-TB-2"
    },
    {
      "Pravilo": "HR-BR-17",
      "Opis": "Ako se koristi referenca narudžbenice na stavci računa (HR-BT-9), zabranjeno je koristiti BT-13 Referencu narudžbenice na razni računa"
    },
    {
      "Pravilo": "HR-BR-18",
      "Opis": "Ako se koristi referenca otpremnice na stavci računa (HR-BT-10), zabranjeno je koristiti BT-16 Referencu otpremnice na razni računa"
    },
    {
      "Pravilo": "HR-BR-19",
      "Opis": "Ako se koristi referenca primke na stavci računa (HR-BT-11), zabranjeno je koristiti BT-15 Referencu primke na razni računa"
    },
    {
      "Pravilo": "HR-BR-20",
      "Opis": "Jedinična količina za cijenu artikla, ako je iskazana, MORA biti pozitivan broj veći od nule"
    },
    {
      "Pravilo": "HR-BR-21",
      "Opis": "Jedinica mjere jedinične količine cijene artikla, ako je iskazan, MORA biti jednaka jedinici mjere obračunate količine (BT-130)"
    },
    {
      "Pravilo": "HR-BR-25",
      "Opis": "Svaki artikl MORA imati identifikator klasifikacije artikla iz sheme Klasifikacija proizvoda po djelatnostima: KPD (CPA) – listID „CG“, osim u slučaju računa za predujam."
    },
    {
      "Pravilo": "HR-BR-26",
      "Opis": "Račun koji sadržava stavku računa (BG-25), popust na razini dokumenta (BG-20) ili trošak na razini dokumenta (BG-21), gdje je kod kategorije PDV-a (BT-151, BT-95 ili BT-102) „oslobođeno od PDV-a“ mora u za svaki razlog oslobođenja od PDV-a ili kod razloga oslobođenja od PDV-a sadržavati HR raspodjelu oslobođenja od PDV (HR-BG-2)"
    },
    {
      "Pravilo": "HR-BR-27",
      "Opis": "U HR raspodjeli PDV-a (HR-BG-2) HR oporezivi iznos (HR-BT-17) mora biti jednak zbroju neto iznosa stavki računa (BT-131) umanjen za zbroj iznosa popusta na razini dokumenta (BT-92) uvećan za zbroj iznosa troškova na razini dokumenta (BT-99) i umanjen za HR neoporezivi iznos (HR-BT-20)."
    },
    {
      "Pravilo": "HR-BR-28",
      "Opis": "Za cac:TaxScheme = „VAT“ i kod porezne kategorije „E“ ili „O“ HR iznos porezne kategorije mora biti 0"
    },
    {
      "Pravilo": "HR-BR-29",
      "Opis": "Stavke računa, troškovi ili popusti koji ne ulaze u poreznu osnovicu HR kod kategorije PDV-a (HR-BT-18) mora biti „O“, a HR iznos kategorije poreza (HR-BT-17) mora biti 0"
    },
    {
      "Pravilo": "HR-BR-30",
      "Opis": "HR Ukupni iznosi računa (HR-BG-3) se navodi na računu ako račun sadrži stavke računa (BG-25) ili troškove na razini dokumenta (BG-21) koji ne ulaze u poreznu osnovicu računa."
    },
    {
      "Pravilo": "HR-BR-31",
      "Opis": "HR porezna osnovica (HR-BT-19) je ukupan neto iznos stavki računa (BT-131) koje ulaze u poreznu osnovicu umanjen za zbroj iznosa popusta na razini dokumenta (BT-92) i uvećan za zbroj iznosa troškova na razini dokumenta (BT-99) koje ulaze u poreznu osnovicu umanjen za HR neoporezivi iznos (HR-BT-24)."
    },
    {
      "Pravilo": "HR-BR-32",
      "Opis": "HR neoporezivi iznos (HR-BT-20) jednak je zbroju neto iznosa stavki računa (BT-131) koje NE ulaze u poreznu osnovicu umanjen za zbroj iznosa popusta na razini dokumenta (BT-92) i uvećan za zbroj iznosa troškova na razini dokumenta (BT-99) koje NE ulaze u poreznu osnovicu."
    },
    {
      "Pravilo": "HR-BR-33",
      "Opis": "Račun ne smije sadržavati prazne xml elemente osim elementa s elektroničkim potpisom računa."
    },
    {
      "Pravilo": "HR-BR-34",
      "Opis": "Oznaka procesa MORA biti navedena. Koriste se vrijednosti P1-P12 ili P99:Oznaka kupca iz Tablice 4 Tipovi poslovnog procesa"
    },
    {
      "Pravilo": "HR-BR-35",
      "Opis": "Svaka stavka računa (BG-25) koji ne podliježe PDV-u ili je oslobođena od PDV-a mora imati kod kategorije PDV-a „E“ (BT-151) i stopu PDV-a (BT-152) jednaku 0"
    },
    {
      "Pravilo": "HR-BR-36",
      "Opis": "Svaka stavka računa (BG-25) koji ne podliježe PDV-u ili je oslobođena od PDV-a mora imati razlog oslobođenja PDV-a (HR-BT-13) ili kod razloga oslobođenja PDV-a (HR-BT-14)"
    },
    {
      "Pravilo": "HR-BR-37",
      "Opis": "Račun mora sadržavati oznaku operatera (HR-BT-4)"
    },
    {
      "Pravilo": "HR-BR-S-1",
      "Opis": "Račun koji sadrži stavku računa (BG-25) u kojoj je kod kategorije PDV-a obračunate stavke (BT-151) \"Standard rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-S-2",
      "Opis": "Račun koji sadrži popuste na razini dokumenta (BG-20) gdje je kod kategorije PDV-a popusta na razini dokumenta (BT-95) \"Standard rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-S-3",
      "Opis": "Račun koji sadrži troškove na razini dokumenta (BG-21) gdje je kod kategorije PDV-a troška na razini dokumenta (BT-102) \"Standard rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-Z-1",
      "Opis": "Račun koji sadrži stavku računa (BG-25) u kojoj je kod kategorije PDV-a obračunate stavke (BT-151) \"Zero rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-Z-2",
      "Opis": "Račun koji sadrži popuste na razini dokumenta (BG-20) gdje je kod kategorije PDV-a popusta na razini dokumenta (BT-95) \"Zero rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-Z-3",
      "Opis": "Račun koji sadrži troškove na razini dokumenta (BG-21) gdje je kod kategorije PDV-a troška na razini dokumenta (BT-102) \"Zero rated\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-E-1",
      "Opis": "Račun koji sadrži stavku računa (BG-25) u kojoj je kod kategorije PDV-a obračunate stavke (BT-151) \"Exempt from VAT\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-E-2",
      "Opis": "Račun koji sadrži popuste na razini dokumenta (BG-20) gdje je kod kategorije PDV-a popusta na razini dokumenta (BT-95) \"Exempt from VAT\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-E-3",
      "Opis": "Račun koji sadrži troškove na razini dokumenta (BG-21) gdje je kod kategorije PDV-a troška na razini dokumenta (BT-102) \"Exempt from VAT\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-AE-1",
      "Opis": "Račun koji sadrži stavku računa (BG-25) u kojoj je kod kategorije PDV-a obračunate stavke (BT-151) \"Reverse charge\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-AE-2",
      "Opis": "Račun koji sadrži popuste na razini dokumenta (BG-20) gdje je kod kategorije PDV-a popusta na razini dokumenta (BT-95) \"Reverse charge\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    },
    {
      "Pravilo": "HR-BR-AE-3",
      "Opis": "Račun koji sadrži troškove na razini dokumenta (BG-21) gdje je kod kategorije PDV-a troška na razini dokumenta (BT-102) \"Reverse charge\" mora sadržavati PDV identifikacijski broj Kupca (BT-48)."
    }
  ]
}